In [1]:
#importar bibliotecas

import pandas as pd
import numpy as np

from pandas import DataFrame

In [2]:
#criando um conjunto de dados

dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a','a','b','b','c','c','c'],
    'coluna 3': ['A','A','B','B','C','C','C']
}

df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [3]:
#Removendo dados duplicados

df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [4]:
df.drop_duplicates() #esse comando só visualiza como ficaria o dataframe retirando os dados duplicados

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

In [6]:
df.drop_duplicates(inplace=True) #esse comando remove mesmo -inplace=True
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
2         2        b        B
4         3        c        C

In [7]:
#criando um conjunto de dados
#alterando na coluna 3 o valor da primeira posição

dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a','a','b','b','c','c','c'],
    'coluna 3': ['D','A','B','B','C','C','C']
}

df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [8]:
df.drop_duplicates(['coluna 3'])
#leva em consideração os duplicados apenas na coluna 3

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
4         3        c        C